In [1]:
import acquired
import prepare
import pandas as pd
import  numpy as np

In [159]:
df = acquired.get_titanic_data()

this file exists, reading csv

In [160]:
df.pop('Unnamed: 0')

0        0
1        1
2        2
3        3
4        4
      ...
886    886
887    887
888    888
889    889
890    890
Name: Unnamed: 0, Length: 891, dtype: int64

In [161]:
df.head()

,passenger_id,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,deck,embark_town,alone
0,0,0,3,male,22.0,1,0,7.2500,S,Third,NaN,Southampton,0
1,1,1,1,female,38.0,1,0,71.2833,C,First,C,Cherbourg,0
2,2,1,3,female,26.0,0,0,7.9250,S,Third,NaN,Southampton,1
3,3,1,1,female,35.0,1,0,53.1000,S,First,C,Southampton,0
4,4,0,3,male,35.0,0,0,8.0500,S,Third,NaN,Southampton,1

In [162]:
prepare.clean_titanic(df)

,passenger_id,survived,pclass,sex,sibsp,parch,fare,embark_town,alone
0,0,0,3,male,1,0,7.2500,Southampton,0
1,1,1,1,female,1,0,71.2833,Cherbourg,0
2,2,1,3,female,0,0,7.9250,Southampton,1
3,3,1,1,female,1,0,53.1000,Southampton,0
4,4,0,3,male,0,0,8.0500,Southampton,1
...,...,...,...,...,...,...,...,...,...
886,886,0,2,male,0,0,13.0000,Southampton,1
887,887,1,1,female,0,0,30.0000,Southampton,1
888,888,0,3,female,1,2,23.4500,Southampton,0
889,889,1,1,male,0,0,30.0000,Cherbourg,1
890,890,0,3,male,0,0,7.7500,Queenstown,1

In [163]:
train, validate, test =prepare.splitting_data(df,'survived')

In [164]:
train.shape

(534, 13)

In [165]:
validate.shape

(178, 13)

In [166]:
test.shape

(179, 13)

In [167]:
train.head()

,passenger_id,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,deck,embark_town,alone
776,776,0,3,male,NaN,0,0,7.7500,Q,Third,F,Queenstown,1
829,829,1,1,female,62.0,0,0,80.0000,NaN,First,B,NaN,1
215,215,1,1,female,31.0,1,0,113.2750,C,First,D,Cherbourg,0
258,258,1,1,female,35.0,0,0,512.3292,C,First,NaN,Cherbourg,1
129,129,0,3,male,45.0,0,0,6.9750,S,Third,NaN,Southampton,1

In [168]:
train.shape, df.shape

((534, 13), (891, 13))

>train

In [169]:
encoded_train = train.assign(sex_male = np.where(train['sex'] == 'male', 1, 0))
encoded_train.head()

,passenger_id,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,deck,embark_town,alone,sex_male
776,776,0,3,male,NaN,0,0,7.7500,Q,Third,F,Queenstown,1,1
829,829,1,1,female,62.0,0,0,80.0000,NaN,First,B,NaN,1,0
215,215,1,1,female,31.0,1,0,113.2750,C,First,D,Cherbourg,0,0
258,258,1,1,female,35.0,0,0,512.3292,C,First,NaN,Cherbourg,1,0
129,129,0,3,male,45.0,0,0,6.9750,S,Third,NaN,Southampton,1,1

In [170]:
train.head()

,passenger_id,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,deck,embark_town,alone
776,776,0,3,male,NaN,0,0,7.7500,Q,Third,F,Queenstown,1
829,829,1,1,female,62.0,0,0,80.0000,NaN,First,B,NaN,1
215,215,1,1,female,31.0,1,0,113.2750,C,First,D,Cherbourg,0
258,258,1,1,female,35.0,0,0,512.3292,C,First,NaN,Cherbourg,1
129,129,0,3,male,45.0,0,0,6.9750,S,Third,NaN,Southampton,1

In [171]:
encoded_train = train.assign(sex_female = np.where(train['sex'] == 'male', 0, 1))
encoded_train.head()

,passenger_id,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,deck,embark_town,alone,sex_female
776,776,0,3,male,NaN,0,0,7.7500,Q,Third,F,Queenstown,1,0
829,829,1,1,female,62.0,0,0,80.0000,NaN,First,B,NaN,1,1
215,215,1,1,female,31.0,1,0,113.2750,C,First,D,Cherbourg,0,1
258,258,1,1,female,35.0,0,0,512.3292,C,First,NaN,Cherbourg,1,1
129,129,0,3,male,45.0,0,0,6.9750,S,Third,NaN,Southampton,1,0

In [172]:
encoded_train[['is_queenstown', 'is_southampton']] = pd.get_dummies(encoded_train.embark_town, drop_first=True).astype(int)
encoded_train.head()

,passenger_id,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,deck,embark_town,alone,sex_female,is_queenstown,is_southampton
776,776,0,3,male,NaN,0,0,7.7500,Q,Third,F,Queenstown,1,0,1,0
829,829,1,1,female,62.0,0,0,80.0000,NaN,First,B,NaN,1,1,0,0
215,215,1,1,female,31.0,1,0,113.2750,C,First,D,Cherbourg,0,1,0,0
258,258,1,1,female,35.0,0,0,512.3292,C,First,NaN,Cherbourg,1,1,0,0
129,129,0,3,male,45.0,0,0,6.9750,S,Third,NaN,Southampton,1,0,0,1

In [173]:
encoded_train.pop(['sex', 'embark_town'])

InvalidIndexError: ['sex', 'embark_town']

> validate

In [174]:
encoded_validate = validate.assign(sex_male = np.where(validate['sex'] == 'male', 1, 0))
encoded_validate.head()

,passenger_id,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,deck,embark_town,alone,sex_male
541,541,0,3,female,9.0,4,2,31.2750,S,Third,NaN,Southampton,0,0
204,204,1,3,male,18.0,0,0,8.0500,S,Third,NaN,Southampton,1,1
108,108,0,3,male,38.0,0,0,7.8958,S,Third,NaN,Southampton,1,1
88,88,1,1,female,23.0,3,2,263.0000,S,First,C,Southampton,0,0
677,677,1,3,female,18.0,0,0,9.8417,S,Third,NaN,Southampton,1,0

In [175]:
encoded_validate = validate.assign(sex_female = np.where(validate['sex'] == 'male', 0, 1))
encoded_validate.head()

,passenger_id,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,deck,embark_town,alone,sex_female
541,541,0,3,female,9.0,4,2,31.2750,S,Third,NaN,Southampton,0,1
204,204,1,3,male,18.0,0,0,8.0500,S,Third,NaN,Southampton,1,0
108,108,0,3,male,38.0,0,0,7.8958,S,Third,NaN,Southampton,1,0
88,88,1,1,female,23.0,3,2,263.0000,S,First,C,Southampton,0,1
677,677,1,3,female,18.0,0,0,9.8417,S,Third,NaN,Southampton,1,1

In [176]:
encoded_validate[['is_queenstown', 'is_southampton']] = pd.get_dummies(encoded_validate.embark_town, drop_first=True).astype(int)
encoded_validate.head()

,passenger_id,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,deck,embark_town,alone,sex_female,is_queenstown,is_southampton
541,541,0,3,female,9.0,4,2,31.2750,S,Third,NaN,Southampton,0,1,0,1
204,204,1,3,male,18.0,0,0,8.0500,S,Third,NaN,Southampton,1,0,0,1
108,108,0,3,male,38.0,0,0,7.8958,S,Third,NaN,Southampton,1,0,0,1
88,88,1,1,female,23.0,3,2,263.0000,S,First,C,Southampton,0,1,0,1
677,677,1,3,female,18.0,0,0,9.8417,S,Third,NaN,Southampton,1,1,0,1

In [177]:
encoded_validate.pop('embark_town')

541    Southampton
204    Southampton
108    Southampton
88     Southampton
677    Southampton
          ...
171     Queenstown
369      Cherbourg
114      Cherbourg
855    Southampton
885     Queenstown
Name: embark_town, Length: 178, dtype: object

In [178]:
encoded_validate.pop('sex')

541    female
204      male
108      male
88     female
677    female
        ...
171      male
369    female
114    female
855    female
885    female
Name: sex, Length: 178, dtype: object

> test

In [179]:
encoded_test = test.assign(sex_male = np.where(test['sex'] == 'male', 1, 0))
encoded_test.head()

,passenger_id,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,deck,embark_town,alone,sex_male
763,763,1,1,female,36.0,1,2,120.0000,S,First,B,Southampton,0,0
112,112,0,3,male,22.0,0,0,8.0500,S,Third,NaN,Southampton,1,1
230,230,1,1,female,35.0,1,0,83.4750,S,First,C,Southampton,0,0
500,500,0,3,male,17.0,0,0,8.6625,S,Third,NaN,Southampton,1,1
237,237,1,2,female,8.0,0,2,26.2500,S,Second,NaN,Southampton,0,0

In [180]:
encoded_test = test.assign(sex_female = np.where(test['sex'] == 'male', 0, 1))
encoded_test.head()

,passenger_id,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,deck,embark_town,alone,sex_female
763,763,1,1,female,36.0,1,2,120.0000,S,First,B,Southampton,0,1
112,112,0,3,male,22.0,0,0,8.0500,S,Third,NaN,Southampton,1,0
230,230,1,1,female,35.0,1,0,83.4750,S,First,C,Southampton,0,1
500,500,0,3,male,17.0,0,0,8.6625,S,Third,NaN,Southampton,1,0
237,237,1,2,female,8.0,0,2,26.2500,S,Second,NaN,Southampton,0,1

In [181]:
encoded_test[['is_queenstown', 'is_southampton']] = pd.get_dummies(encoded_test.embark_town, drop_first=True).astype(int)
encoded_test.head()

,passenger_id,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,deck,embark_town,alone,sex_female,is_queenstown,is_southampton
763,763,1,1,female,36.0,1,2,120.0000,S,First,B,Southampton,0,1,0,1
112,112,0,3,male,22.0,0,0,8.0500,S,Third,NaN,Southampton,1,0,0,1
230,230,1,1,female,35.0,1,0,83.4750,S,First,C,Southampton,0,1,0,1
500,500,0,3,male,17.0,0,0,8.6625,S,Third,NaN,Southampton,1,0,0,1
237,237,1,2,female,8.0,0,2,26.2500,S,Second,NaN,Southampton,0,1,0,1

In [182]:
encoded_test.pop('sex')

763    female
112      male
230    female
500      male
237    female
        ...
883      male
149      male
843      male
581    female
214      male
Name: sex, Length: 179, dtype: object

In [183]:
encoded_test.pop('embark_town')

763    Southampton
112    Southampton
230    Southampton
500    Southampton
237    Southampton
          ...
883    Southampton
149    Southampton
843      Cherbourg
581      Cherbourg
214     Queenstown
Name: embark_town, Length: 179, dtype: object

In [184]:
encoded_test.head()

,passenger_id,survived,pclass,age,sibsp,parch,fare,embarked,class,deck,alone,sex_female,is_queenstown,is_southampton
763,763,1,1,36.0,1,2,120.0000,S,First,B,0,1,0,1
112,112,0,3,22.0,0,0,8.0500,S,Third,NaN,1,0,0,1
230,230,1,1,35.0,1,0,83.4750,S,First,C,0,1,0,1
500,500,0,3,17.0,0,0,8.6625,S,Third,NaN,1,0,0,1
237,237,1,2,8.0,0,2,26.2500,S,Second,NaN,0,1,0,1

In [188]:
def preprocess_titanic(train, validate, test):
    # Define a function that applies the encoding
    def encode(df):
        # Encoding the 'sex' column
        df_encoded = df.copy()
        df_encoded['sex_male'] = np.where(df_encoded['sex'] == 'male', 1, 0)
        df_encoded['sex_female'] = np.where(df_encoded['sex'] == 'male', 0, 1)

        # Encoding the 'embark_town' column
        embark_town_dummies = pd.get_dummies(df_encoded['embark_town'], drop_first=True).astype(int)
        df_encoded[['is_queenstown', 'is_southampton']] = embark_town_dummies

        # Drop the original categorical columns and unnecesary
        df_encoded = df_encoded.drop(columns=['sex', 'embark_town'])
        df_encoded = df_encoded.drop(columns='passenger_id')
        return df_encoded

    # Apply the encoding function to each dataset and store in new variables
    encoded_train = encode(train)
    encoded_validate = encode(validate)
    encoded_test = encode(test)

    return encoded_train, encoded_validate, encoded_test

In [193]:
encoded_train, encoded_validate, encoded_test = preprocess_titanic(train, validate, test)

In [213]:
encoded_train.head()

,survived,pclass,age,sibsp,parch,fare,embarked,class,deck,alone,sex_male,sex_female,is_queenstown,is_southampton
776,0,3,NaN,0,0,7.7500,Q,Third,F,1,1,0,1,0
829,1,1,62.0,0,0,80.0000,NaN,First,B,1,0,1,0,0
215,1,1,31.0,1,0,113.2750,C,First,D,0,0,1,0,0
258,1,1,35.0,0,0,512.3292,C,First,NaN,1,0,1,0,0
129,0,3,45.0,0,0,6.9750,S,Third,NaN,1,1,0,0,1

In [315]:
# get telco data
df =acquired.get_telco_data()
df.head()

this file exists, reading csv

,Unnamed: 0,payment_type_id,internet_service_type_id,contract_type_id,customer_id,gender,senior_citizen,partner,dependents,tenure,...,tech_support,streaming_tv,streaming_movies,paperless_billing,monthly_charges,total_charges,churn,contract_type,internet_service_type,payment_type
0,0,2,1,2,0002-ORFBO,Female,0,Yes,Yes,9,...,Yes,Yes,No,Yes,65.6,593.3,No,One year,DSL,Mailed check
1,1,2,1,1,0003-MKNFE,Male,0,No,No,9,...,No,No,Yes,No,59.9,542.4,No,Month-to-month,DSL,Mailed check
2,2,1,2,1,0004-TLHLJ,Male,0,No,No,4,...,No,No,No,Yes,73.9,280.85,Yes,Month-to-month,Fiber optic,Electronic check
3,3,1,2,1,0011-IGKFF,Male,1,Yes,No,13,...,No,Yes,Yes,Yes,98.0,1237.85,Yes,Month-to-month,Fiber optic,Electronic check
4,4,2,2,1,0013-EXCHZ,Female,1,Yes,No,3,...,Yes,Yes,No,Yes,83.9,267.4,Yes,Month-to-month,Fiber optic,Mailed check

In [316]:
# preparing telco data
df = prepare.prep_telco(df)
df.head()

,customer_id,gender,senior_citizen,partner,dependents,tenure,phone_service,multiple_lines,online_security,online_backup,...,tech_support,streaming_tv,streaming_movies,paperless_billing,monthly_charges,total_charges,churn,contract_type,internet_service_type,payment_type
0,0002-ORFBO,Female,0,Yes,Yes,9,Yes,No,No,Yes,...,Yes,Yes,No,Yes,65.6,593.3,No,One year,DSL,Mailed check
1,0003-MKNFE,Male,0,No,No,9,Yes,Yes,No,No,...,No,No,Yes,No,59.9,542.4,No,Month-to-month,DSL,Mailed check
2,0004-TLHLJ,Male,0,No,No,4,Yes,No,No,No,...,No,No,No,Yes,73.9,280.85,Yes,Month-to-month,Fiber optic,Electronic check
3,0011-IGKFF,Male,1,Yes,No,13,Yes,No,No,Yes,...,No,Yes,Yes,Yes,98.0,1237.85,Yes,Month-to-month,Fiber optic,Electronic check
4,0013-EXCHZ,Female,1,Yes,No,3,Yes,No,No,No,...,Yes,Yes,No,Yes,83.9,267.4,Yes,Month-to-month,Fiber optic,Mailed check

In [317]:
prepare.splitting_data(df, 'churn')

(     customer_id  gender  senior_citizen partner dependents  tenure  \
 5671  7994-XIRTR    Male               1      No         No      54
 6843  9717-QEBGU    Male               0      No         No       2
 2325  3324-OIRTO    Male               0     Yes        Yes      71
 6323  8950-MTZNV    Male               0      No         No       1
 3081  4415-WNGVR  Female               1     Yes         No      12
 ...          ...     ...             ...     ...        ...     ...
 6803  9658-WYUFB  Female               0      No         No      17
 2521  3605-JISKB    Male               1     Yes         No      55
 3705  5214-CHIWJ    Male               0      No         No      27
 4717  6646-VRFOL    Male               1     Yes         No      53
 1332  1982-FEBTD  Female               0     Yes        Yes      23

      phone_service multiple_lines      online_security        online_backup  \
 5671           Yes             No                   No                   No
 6843           Yes             No                   No                   No
 2325           Yes             No                  Yes                  Yes
 6323           Yes             No                   No                   No
 3081           Yes             No                  Yes                   No
 ...            ...            ...                  ...                  ...
 6803           Yes            Yes                  Yes                  Yes
 2521           Yes            Yes                  Yes                  Yes
 3705           Yes             No  No internet service  No internet service
 4717           Yes            Yes                   No                  Yes
 1332           Yes            Yes  No internet service  No internet service

       ...         tech_support         streaming_tv     streaming_movies  \
 5671  ...                  Yes                   No                  Yes
 6843  ...                   No                   No                   No
 2325  ...                   No                  Yes                  Yes
 6323  ...                   No                   No                   No
 3081  ...                  Yes                  Yes                  Yes
 ...   ...                  ...                  ...                  ...
 6803  ...                   No                  Yes                   No
 2521  ...                   No                   No                   No
 3705  ...  No internet service  No internet service  No internet service
 4717  ...                   No                  Yes                  Yes
 1332  ...  No internet service  No internet service  No internet service

      paperless_billing monthly_charges  total_charges churn   contract_type  \
 5671                No           65.25        3529.95    No        One year
 6843               Yes           70.30            144    No  Month-to-month
 2325               Yes          104.65         7288.4    No        One year
 6323               Yes           44.95          44.95    No  Month-to-month
 3081               Yes           79.20         943.85    No        One year
 ...                ...             ...            ...   ...             ...
 6803               Yes           94.40         1617.5   Yes  Month-to-month
 2521                No           60.00         3316.1    No        One year
 3705                No           20.30         595.05    No        One year
 4717               Yes          103.85         5485.5   Yes  Month-to-month
 1332               Yes           25.60         514.75    No        Two year

      internet_service_type               payment_type
 5671                   DSL  Bank transfer (automatic)
 6843           Fiber optic           Electronic check
 2325           Fiber optic  Bank transfer (automatic)
 6323                   DSL               Mailed check
 3081                   DSL           Electronic check
 ...                    ...                        ...
 6803           Fiber optic           Electronic check
 2521                   DSL    Credit card (automatic)
 3705                   NaN               Mailed check
 4717           Fiber optic           Electronic check
 1332                   NaN    Credit card (automatic)

 [4219 rows x 21 columns],
      customer_id  gender  senior_citizen partner dependents  tenure  \
 4911  6910-HADCM  Female               0      No         No       1
 940   1360-JYXKQ  Female               1     Yes         No      54
 5083  7139-JZFVG    Male               0     Yes        Yes      60
 545   0804-YGEQV  Female               0     Yes        Yes      43
 6486  9189-JWSHV  Female               1     Yes         No      24
 ...          ...     ...             ...     ...        ...     ...
 3113  4464-JCOLN    Male               0     Yes        Yes       2
 673   0983-TATYJ  Female               0     Yes         No      33
 5894  8292-ITGYJ  Female               0     Yes        Yes      45
 1850  2684-EIWEO  Female               1      No         No      30
 6104  8644-XYTSV    Male               0     Yes         No      42

      phone_service    multiple_lines      online_security  \
 4911           Yes                No                   No
 940            Yes                No                   No
 5083           Yes                No                  Yes
 545            Yes               Yes  No internet service
 6486           Yes               Yes                   No
 ...            ...               ...                  ...
 3113           Yes                No  No internet service
 673            Yes                No                   No
 5894           Yes               Yes  No internet service
 1850           Yes               Yes                  Yes
 6104            No  No phone service                  Yes

             online_backup  ...         tech_support         streaming_tv  \
 4911                   No  ...                   No                   No
 940                    No  ...                  Yes                  Yes
 5083                  Yes  ...                   No                   No
 545   No internet service  ...  No internet service  No internet service
 6486                   No  ...                   No                  Yes
 ...                   ...  ...                  ...                  ...
 3113  No internet service  ...  No internet service  No internet service
 673                    No  ...                  Yes                   No
 5894  No internet service  ...  No internet service  No internet service
 1850                  Yes  ...                   No                   No
 6104                   No  ...                   No                  Yes

          streaming_movies paperless_billing monthly_charges  total_charges  \
 4911                   No                No           76.35          76.35
 940                   Yes               Yes           99.10         5437.1
 5083                   No                No           60.50        3694.45
 545   No internet service               Yes           24.45         993.15
 6486                  Yes               Yes           93.55        2264.05
 ...                   ...               ...             ...            ...
 3113  No internet service                No           19.85           35.9
 673                    No               Yes           51.45         1758.9
 5894  No internet service               Yes           24.65         1138.8
 1850                   No                No           91.70        2758.15
 6104                   No               Yes           40.15        1626.05

      churn   contract_type internet_service_type               payment_type
 4911   Yes  Month-to-month           Fiber optic           Electronic check
 940     No        One year           Fiber optic           Electronic check
 5083    No        Two year                   DSL  Bank transfer (automatic)
 545     No        One year                   NaN  Bank transfer (automatic)
 6486   Yes  Month-to-month           Fiber optic           Electronic check
 ...    ...             ...                   ...                        ...
 3113   Yes        One year                   NaN               Mailed check
 673     No        One year                   DSL               Mailed check
 5894    No        Two year                   NaN  Bank transfer (automatic)
 1850   Yes  Month-to-month           Fiber optic    Credit card (automatic)
 6104    No  Month-to-month                   DSL  Bank transfer (automatic)

 [1406 rows x 21 columns],
      customer_id  gender  senior_citizen partner dependents  tenure  \
 1865  2706-QZIHY  Female               0     Yes         No      15
 3786  5324-KTGCG    Male               0     Yes         No      71
 4712  6637-KYRCV  Female               0     Yes        Yes       5
 5123  7207-RMRDB  Female               0     Yes        Yes      65
 5128  7217-JYHOQ    Male               0     Yes        Yes      24
 ...          ...     ...             ...     ...        ...     ...
 6351  8992-JQYUN    Male               0     Yes         No       1
 2277  3255-GRXMG    Male               0      No        Yes      18
 6061  8591-NXRCV  Female               0      No         No      41
 3446  4884-LEVMQ    Male               0     Yes         No      39
 4892  6893-ODYYE    Male               0      No         No      50

      phone_service    multiple_lines      online_security  \
 1865           Yes               Yes  No internet service
 3786           Yes                No  No internet service
 4712            No  No phone service                   No
 5123           Yes               Yes                   No
 5128           Yes                No                  Yes
 ...            ...               ...                  ...
 6351            No  No phone service                   No
 2277           Yes                No                   No
 6061           Yes               Yes                  Yes
 3446           Yes                No  No internet service
 4892           Yes                No                  Yes

             online_backup  ...         tech_support         streaming_tv  \
 1865  No internet service  ...  No internet service  No internet service
 3786  No internet service  ...  No internet service  No internet service
 4712                  Yes  ...                   No                   No
 5123                  Yes  ...                   No                  Yes
 5128                  Yes  ...                  Yes                   No
 ...                   ...  ...                  ...                  ...
 6351                   No  ...                   No                  Yes
 2277                   No  ...                   No                   No
 6061                   No  ...                  Yes                   No
 3446  No internet service  ...  No internet service  No internet service
 4892                  Yes  ...                  Yes                   No

          streaming_movies paperless_billing monthly_charges  total_charges  \
 1865  No internet service                No           25.20          387.9
 3786  No internet service                No           20.85        1539.75
 4712                   No               Yes           30.50          167.2
 5123                  Yes               Yes          105.50        6985.65
 5128                  Yes               Yes           70.30        1706.45
 ...                   ...               ...             ...            ...
 6351                  Yes               Yes           50.35          50.35
 2277                   No               Yes           45.65          747.2
 6061                  Yes               Yes           74.65        3090.65
 3446  No internet service               Yes           20.45            790
 4892                   No               Yes           90.10        4549.45

      churn   contract_type internet_service_type               payment_type
 1865    No        Two year                   NaN               Mailed check
 3786    No        One year                   NaN           Electronic check
 4712    No  Month-to-month                   DSL           Electronic check
 5123   Yes  Month-to-month           Fiber optic           Electronic check
 5128    No  Month-to-month                   DSL    Credit card (automatic)
 ...    ...             ...                   ...                        ...
 6351   Yes  Month-to-month                   DSL           Electronic check
 2277    No  Month-to-month                   DSL    Credit card (automatic)
 6061    No  Month-to-month                   DSL  Bank transfer (automatic)
 3446    No        Two year                   NaN  Bank transfer (automatic)
 4892    No        One year           Fiber optic    Credit card (automatic)

 [1407 rows x 21 columns])

In [318]:
train, validate, test = prepare.splitting_data(df, 'churn')

In [319]:
train.shape

(4219, 21)

In [320]:
validate.shape

(1406, 21)

In [321]:
test.shape

(1407, 21)

In [322]:
train.head()

,customer_id,gender,senior_citizen,partner,dependents,tenure,phone_service,multiple_lines,online_security,online_backup,...,tech_support,streaming_tv,streaming_movies,paperless_billing,monthly_charges,total_charges,churn,contract_type,internet_service_type,payment_type
5671,7994-XIRTR,Male,1,No,No,54,Yes,No,No,No,...,Yes,No,Yes,No,65.25,3529.95,No,One year,DSL,Bank transfer (automatic)
6843,9717-QEBGU,Male,0,No,No,2,Yes,No,No,No,...,No,No,No,Yes,70.30,144,No,Month-to-month,Fiber optic,Electronic check
2325,3324-OIRTO,Male,0,Yes,Yes,71,Yes,No,Yes,Yes,...,No,Yes,Yes,Yes,104.65,7288.4,No,One year,Fiber optic,Bank transfer (automatic)
6323,8950-MTZNV,Male,0,No,No,1,Yes,No,No,No,...,No,No,No,Yes,44.95,44.95,No,Month-to-month,DSL,Mailed check
3081,4415-WNGVR,Female,1,Yes,No,12,Yes,No,Yes,No,...,Yes,Yes,Yes,Yes,79.20,943.85,No,One year,DSL,Electronic check

In [323]:
# encoding the gender
train['is_male'] = train['gender'].replace({'Male': 1, 'Female': 0})

In [324]:
# encoding the partner column
train['alone'] = train['partner'].map({'Yes': 0, 'No': 1})

In [325]:
train.head()

,customer_id,gender,senior_citizen,partner,dependents,tenure,phone_service,multiple_lines,online_security,online_backup,...,streaming_movies,paperless_billing,monthly_charges,total_charges,churn,contract_type,internet_service_type,payment_type,is_male,alone
5671,7994-XIRTR,Male,1,No,No,54,Yes,No,No,No,...,Yes,No,65.25,3529.95,No,One year,DSL,Bank transfer (automatic),1,1
6843,9717-QEBGU,Male,0,No,No,2,Yes,No,No,No,...,No,Yes,70.30,144,No,Month-to-month,Fiber optic,Electronic check,1,1
2325,3324-OIRTO,Male,0,Yes,Yes,71,Yes,No,Yes,Yes,...,Yes,Yes,104.65,7288.4,No,One year,Fiber optic,Bank transfer (automatic),1,0
6323,8950-MTZNV,Male,0,No,No,1,Yes,No,No,No,...,No,Yes,44.95,44.95,No,Month-to-month,DSL,Mailed check,1,1
3081,4415-WNGVR,Female,1,Yes,No,12,Yes,No,Yes,No,...,Yes,Yes,79.20,943.85,No,One year,DSL,Electronic check,0,0

In [326]:
train.alone.nunique()

2

In [327]:
# Creating dummy variables
contract_dummies = pd.get_dummies(train['contract_type'], drop_first=True)
internet_type_dummies = pd.get_dummies(train['internet_service_type'], drop_first=True)

# Concatenating them onto the DataFrame
train = pd.concat([train, contract_dummies, internet_type_dummies], axis=1)

In [328]:
train.head()

,customer_id,gender,senior_citizen,partner,dependents,tenure,phone_service,multiple_lines,online_security,online_backup,...,total_charges,churn,contract_type,internet_service_type,payment_type,is_male,alone,One year,Two year,Fiber optic
5671,7994-XIRTR,Male,1,No,No,54,Yes,No,No,No,...,3529.95,No,One year,DSL,Bank transfer (automatic),1,1,True,False,False
6843,9717-QEBGU,Male,0,No,No,2,Yes,No,No,No,...,144,No,Month-to-month,Fiber optic,Electronic check,1,1,False,False,True
2325,3324-OIRTO,Male,0,Yes,Yes,71,Yes,No,Yes,Yes,...,7288.4,No,One year,Fiber optic,Bank transfer (automatic),1,0,True,False,True
6323,8950-MTZNV,Male,0,No,No,1,Yes,No,No,No,...,44.95,No,Month-to-month,DSL,Mailed check,1,1,False,False,False
3081,4415-WNGVR,Female,1,Yes,No,12,Yes,No,Yes,No,...,943.85,No,One year,DSL,Electronic check,0,0,True,False,False

In [329]:
def preprocess_telco(train, validate, test):
    ''' Encode the categorical variables in the train, validate, and test datasets.

    This function performs the following encoding steps:
    1. Encodes the 'gender' column into a new binary column 'is_male', where 'Male' is 1 and 'Female' is 0.
    2. Encodes the 'partner' column into a new binary column 'alone', where 'Yes' is mapped to 0 (not alone) and 'No' is mapped to 1 (alone).
    3. Creates dummy variables for other specified categorical columns such as 'contract_type' and 'internet_service_type', dropping the first category to avoid multicollinearity.

    Parameters:
    - train (DataFrame): The training dataset.
    - validate (DataFrame): The validation dataset.
    - test (DataFrame): The test dataset.

    The function modifies these datasets in place by adding new encoded columns and returns them.

    Returns:
    - DataFrame: The modified train dataset with encoded variables.
    - DataFrame: The modified validate dataset with encoded variables.
    - DataFrame: The modified test dataset with encoded variables. 
    '''
    # dropping the columns changed
    train = train.drop(columns=['gender', 'partner', 'contract_type', 'internet_service_type'])
    validate = validate.drop(columns=['gender', 'partner', 'contract_type', 'internet_service_type'])
    test = test.drop(columns=['gender', 'partner', 'contract_type', 'internet_service_type'])
    # Define encoding for 'gender' using .replace()
    gender_encode = {'Male': 1, 'Female': 0}
    train['is_male'] = train['gender'].replace(gender_encode)
    validate['is_male'] = validate['gender'].replace(gender_encode)
    test['is_male'] = test['gender'].replace(gender_encode)

    # Define encoding for 'partner' using .map()
    partner_encode = {'Yes': 0, 'No': 1}
    train['alone'] = train['partner'].map(partner_encode)
    validate['alone'] = validate['partner'].map(partner_encode)
    test['alone'] = test['partner'].map(partner_encode)

    # Create dummy variables for other categorical columns
    # Adjust these based on your specific categorical columns
    for column in ['contract_type', 'internet_service_type']:
        train_dummies = pd.get_dummies(train[column], drop_first=True)
        validate_dummies = pd.get_dummies(validate[column], drop_first=True)
        test_dummies = pd.get_dummies(test[column], drop_first=True)

        train = pd.concat([train, train_dummies], axis=1)
        validate = pd.concat([validate, validate_dummies], axis=1)
        test = pd.concat([test, test_dummies], axis=1)

    return encoded_train, encoded_validate, encoded_test

In [330]:
preprocess_telco(train, validate, test)

KeyError: 'gender'